In [1]:
import pandas as pd
import numpy as np

In [10]:
df = pd.read_csv("C:/Users/korla/Desktop/github my account/Machine Learning/Naive baye's/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [11]:
df = df[['Cabin','Survived']]
df.head()

  Cabin  Survived
0   NaN         0
1   C85         1
2   NaN         1
3  C123         1
4   NaN         0

In [12]:
df['Cabin'] = df['Cabin'].fillna('Missing')

In [13]:
df.head()

     Cabin  Survived
0  Missing         0
1      C85         1
2  Missing         1
3     C123         1
4  Missing         0

In [15]:
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [16]:
df.head()

  Cabin  Survived
0     M         0
1     C         1
2     M         1
3     C         1
4     M         0

In [17]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [20]:
a = df.groupby(['Cabin'])['Survived'].mean().to_dict()
a

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [21]:
df['Cabin_replaced'] = df['Cabin'].map(a)

In [22]:
df.head()

  Cabin  Survived  Cabin_replaced
0     M         0        0.299854
1     C         1        0.593220
2     M         1        0.299854
3     C         1        0.593220
4     M         0        0.299854